#+TITLE: fastfetch
#+DATE: 2026-03-16T20:30:00+0800
#+TYPE: docs
#+DESCRIPTION: A high-performance system information fetcher written in Zig

#+begin_src bash :results verbatim :exports results :wrap example :dir ../../..
./zig-out/bin/fastfetch -h
#+end_src

#+RESULTS:
#+begin_example
  USAGE:
     ./zig-out/bin/fastfetch [OPTIONS]

 OPTIONS:
  -h, --help                       Print help information.
  -v, --version                    Print version.
#+end_example

** Features
=fastfetch= is a lightweight, high-performance system information fetcher inspired by the original =fastfetch=. It aims to be extremely fast by avoiding external process calls and using native C APIs or virtual filesystems instead.

- **Cross-platform**: Supports both macOS and Linux.
- **Detailed Memory Info**:
  - On macOS: Provides breakdown of App Memory, Wired Memory, and Compressed Memory (matching Activity Monitor).
  - On Linux: Provides Swap usage details.
- **Hardware Insights**: Displays CPU core distribution (Performance vs. Efficiency cores on Apple Silicon), GPU (macOS), and Page Size.
- **High Performance**: Uses =sysctl=, =IOKit=, =CoreFoundation= on macOS and =procfs=, =sysfs= on Linux.

** Demo
#+begin_src bash :results verbatim :exports results :wrap example :dir ../../..
./zig-out/bin/fastfetch
#+end_src

#+RESULTS:
#+begin_example
jiacai@mario
────────────
OS:          macOS 26.3 aarch64
Host:        Mac14,10
Kernel:      25.3.0
Uptime:      18 days, 11 hours, 57 mins
CPU:         Apple M2 Pro (12 cores: 8P + 4E)
Memory:      24837 MiB / 32768 MiB (75%) [App: 8438 MiB, Wired: 3577 MiB, Compressed: 12821 MiB]
Page:        16 KiB
Disk:        827 GiB / 926 GiB (89%)
Battery:     80% [Discharging]
Resolution:  1728x1117
Theme:       Light
Shell:       bash
#+end_example
